# 리스트 접근과 슬라이싱
food = ["치킨", "피자", "햄버거", "삼겹살", "소고기"]

# 인덱싱 -> 0부터 시작
print(food[0])      # 치킨
print(food[2])      # 햄버거

# 음수 인덱싱 -> 뒤에서 부터
print(food[-1])     # 소고기
print(food[-3])     # 햄버거

# 슬라이싱 -> 범위 지정 [시작 : 끝 : 단계]
print(food[1:4])    # ['피자', '햄버거', '삼겹살'] (1번부터 3번까지)
print(food[:3])     # ['치킨', '피자', '햄버거'] (처음부터 2번까지)
print(food[2:])     # ['햄버거', '삼겹살', '소고기'] (2번부터 끝까지)
print(food[::2])    # ['치킨', '햄버거', '소고기'] (처음부터 끝까지 두번씩 건너뜀)
print(food[::-1])   # ['소고기', '삼겹살', '햄버거', '피자', '치킨'] (역순)